#
# 楕円を描画.
# ドキュメントに載っていない隠しメソッド?
#

##################################################
# import
##################################################
import lcd
import image

##################################################
# initialize
##################################################
# LCDを初期化
lcd.init()
# LCDの方向を設定
lcd.direction(lcd.YX_LRUD)

##################################################
# main
##################################################
# 画像を作成
img = image.Image()

# 画像に対して楕円を描画(x, y, x方向半径, y方向半径)
img.draw_ellipse(img.width() // 2, img.height() // 2, img.width() // 4, img.height() // 4)

# 画像をLCDに描画
lcd.display(img)
